blog/app/controllers/concerns/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        # @comment = Comment.new
        @comment = @post.comments.new
        @comment.comment = params[:comment]
        @comment.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
INSERT INTO `comments` (`comment`, `created_at`, `updated_at`, `post_id`) VALUES ('{\"post\"=>\"ahed salama\"}', '2020-03-31 20:55:51.054053', '2020-03-31 20:55:51.054053', 3)

    def destroy
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])
        @comment.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 3 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1