blog/app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`updated_at` DESC
---
    def index
        # render layout: 'my_lay_out'   only //for index method
        # render "controller_name/view_name" //for changing the default naming convention page to be displayed for the views pages
        @posts = Post.order(updated_at: :desc)

INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('mahmoud-update', 'salamaaaaaa', '2020-03-31 16:16:52.218121', '2020-03-31 16:16:52.218121')
---
    def create
        # @post = Post.new
        # @post.title = params[:title]
        # @post.content = params[:content]
        # @post.save

        # or use => redirect_to action :index ,controller: :users
        posts_params = params.permit(:title, :content) #to create a white list
        @post = Post.create(post_params)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
UPDATE `posts` SET `posts`.`title` = 'this post is for testing--updating the blog', `posts`.`content` = 'testing the blog rails -- -updating the blog content', `posts`.`updated_at` = '2020-03-31 21:26:03.368778' WHERE `posts`.`id` = 4
---
    def update
        #validation

        #update
        @post = Post.find(params[:id])
        # posts_params = params.permit([:post][:title])
        @posts_params = params.permit(post_params)
        @post.update(post_params)